---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationProductCode
source: html/8b18d9bc-d2a8-89d9-019d-87ba96a23f64.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationProductCode Property

"Product Code"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationProductCode { get; }
```